"""
Задача 2: Найдите сумму цифр трехзначного числа.
*Пример:*
123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0)
"""
print('Введите трехзначное число: ')
a = int(input())
result = 0
while a > 0:
    result += a % 10
    a = a // 10
print(f"Сумма цифр числа {a} равна: {result}")
