"""
Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. 
Вместе они сделали S журавликов. 
Сколько журавликов сделал каждый ребенок, если известно, 
что Петя и Сережа сделали одинаковое количество журавликов, 
а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
*Пример:*
6 -> 1  4  1
24 -> 4  16  4
60 -> 10  40  10
"""
print('Введите число S: ')
S = int(input())
a = S//6
b = a*4
# Пусть Петя и Сережа сделали по х журавликов, тогда Катя сделала (х+х)*2=х*4 журавликов.
# Тогда общее количество журавликов равно S= х+х+х*4=х*6 журавликов
print(
    f"Катя сделала {b} журавликов, а Петя и Сережа сделали по {a} журавликов")
